In [12]:
 import pandas as pd

CORE OBJECTS IN PANDAS (SERIES AND DATAFRAMES)

 DATAFRAMES

A dataframe is a table that contains individual enties, each if a certain
value (A collection of series)

A dataframe potentially contains heterogeneous (varies,diverse) tabular
structure which contains 2 axes, rows and columns

 Principal components of pandas dataframe is rows and columns

In [6]:
## Example one: create a dataframe using a list

ls = ["Benard", "Ian", "Ernest","Immaculate","Michael"]

# to create dataframe, call the dataframe constructor
df = pd.DataFrame(ls)

df

            0
0      Benard
1         Ian
2      Ernest
3  Immaculate
4     Michael

In [8]:
# Example two: Creating a DataFrame from a dictionary of lists which MUST be the same length
# Assume that you want to represent some votes, YES AND NO

pd.DataFrame({'YES':[100,120,80,40], 'NO': [12,15,12,2]})

   YES  NO
0  100  12
1  120  15
2   80  12
3   40   2

In [9]:
# Example 3 : create a DataFrame to represent names of students with their ages

pd.DataFrame({'NAME':["Ashley", "Steve", "David"], 'AGE':[20,27,18]})

     NAME  AGE
0  Ashley   20
1   Steve   27
2   David   18

In [11]:
# Example 4 : defining our index
reviews = {
    'Ian':["Liked it", "Not bad"],
    "Benard": ["Excellent", "Not Good enough"]
}

pd.DataFrame(reviews,index=[ "A","B"])

        Ian           Benard
A  Liked it        Excellent
B   Not bad  Not Good enough

In [22]:
"""
example 5:
Define a dictionary containing employee data. It should contain the name,age,address
and qualifications
"""

employee_records = {
    'Name':['Joan', 'Jane', 'Peter', 'Mark'],
    'Age':[34,40,20,51],
    'Gender':['F','F','M','M'],
    'Address':['Kisumu','Nairobi','Nairobi','Nakuru'],
    'Qualification':['Msc', 'Bsc', 'Phd','Phd']
}

employee_df = pd.DataFrame(employee_records)
employee_df

    Name  Age Gender  Address Qualification
0   Joan   34      F   Kisumu           Msc
1   Jane   40      F  Nairobi           Bsc
2  Peter   20      M  Nairobi           Phd
3   Mark   51      M   Nakuru           Phd

In [24]:
# To select a column in pandas, 

employee_records = employee_df[['Age', 'Qualification']]
employee_records

   Age Qualification
0   34           Msc
1   40           Bsc
2   20           Phd
3   51           Phd

In [27]:
# Get the sum of a column in employee DataFrame

n = employee_df['Age']
n.sum(axis=0)

145

2) SERIES

A series is a one-dimesional array that holds data of any type (int, float, string, object)

In [6]:
import numpy as np

In [13]:
# Example 1: creating a series from a numpy array


# Create an array
dt = np.array([10,20,30,40,50])

# create the series
s = pd.Series(dt)
s

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [ ]:
# Example 2: Represent sales made from 2010 to 2014 using a series

z = pd.Series([1000,2000,1500,800,10000], index=['2010','2011','2012','2013','2014'])
z

In [34]:
z['2014']

10000

In [14]:
# Top speeds for certain vehicles

v =pd.Series(["200kph","280kph","160kph"], index = ["BMW", "AUDI", "NISSAN"])

v

BMW       200kph
AUDI      280kph
NISSAN    160kph
dtype: object